import request from '@/utils/request'
export default {
  dict(data) {
    return {
      'code': 200,
      'message': '操作成功！',
      'success': true,
      'data': {
        '01': [
          { 'key': '01', 'value': '一号仓库' },
          { 'key': '02', 'value': '二号仓库' },
          { 'key': '03', 'value': '三号仓库' },
          { 'key': '04', 'value': '四号仓库' }
        ],
        '02': [
          { 'key': '01', 'value': '优品' },
          { 'key': '02', 'value': '良品' },
          { 'key': '03', 'value': '下品' }
        ],
        '03': [
          { 'key': '01', 'value': '201团' },
          { 'key': '02', 'value': '201团一营' },
          { 'key': '03', 'value': '201团二营' },
          { 'key': '04', 'value': '201团一营一排' },
          { 'key': '05', 'value': '201团一营二排' },
          { 'key': '06', 'value': '201团二营一排' }
        ]
      }
    }
  },
  equipment() {
    return {
      'code': 200,
      'message': '操作成功！',
      'success': true,
      'data': [
        { 'id': 'a', 'a': '步枪', 'b': '2015-01-06', 'c': '9', 'd': '01', 'e': '1营，2营，3营', 'f': '/upload/legend/20200805/txm.png', 'g': '2015-2019年储备使用' },
        { 'id': 'b', 'a': 'E76-96卡车', 'b': '2015-06-23', 'c': '6', 'd': '02', 'e': '1营，2营，3营', 'f': '/upload/legend/20200805/txm.png', 'g': '物资运输' },
        { 'id': 'c', 'a': '汽车', 'b': '2019-05-15', 'c': '9', 'd': '02', 'e': '日常训练及执勤', 'f': '/upload/legend/20200805/txm.png', 'g': '领导专用' },
        { 'id': 'd', 'a': '工程车', 'b': '2015-11-11', 'c': '3', 'd': '01', 'e': '日常训练及执勤', 'f': '/upload/legend/20200805/txm.png', 'g': '防弹' }
      ]
    }
  },
  page(data) {
    return {
      'code': 200,
      'message': '操作成功！',
      'success': true,
      'data': {
        'content': [
          { 'id': 'a', 'a': '步枪', 'b': '2015-01-06', 'c': '9', 'd': '01', 'e': '1营，2营，3营', 'f': '/upload/legend/20200805/txm.png', 'g': '2015-2019年储备使用',
            'h': '杨梅', 'i': '2019-08-09至2019-08-09', 'j': '', 'k': [{ 'a': '撞针更换' }, { 'a': '扳机弹簧更换' }],
            'l': [
              { 'h': '杨梅', 'i': '2019-01-12', 'j': '多擦油', 'k': [{ 'a': '撞针更换' }, { 'a': '扳机弹簧更换' }] },
              { 'h': '杨梅', 'i': '2019-08-09', 'j': '注意枪身卫生', 'k': [{ 'a': '日常维护' }] }]
          },
          { 'id': 'b', 'a': 'E76-96卡车', 'b': '2015-06-23', 'c': '6', 'd': '02', 'e': '1营，2营，3营', 'f': '/upload/legend/20200805/txm.png', 'g': '物资运输',
            'h': '杨梅', 'i': '2019-08-09至2019-08-09', 'j': '', 'k': [{ 'a': '机油更换' }, { 'a': '后视镜调整' }],
            'l': [
              { 'h': '杨梅', 'i': '2019-01-12', 'j': '无', 'k': [{ 'a': '机油更换' }, { 'a': '汽油滤芯更换' }] },
              { 'h': '杨梅', 'i': '2019-08-09', 'j': '--', 'k': [{ 'a': '机油更换' }, { 'a': '空调滤芯更换' }] }]
          },
          { 'id': 'c', 'a': '汽车', 'b': '2019-05-15', 'c': '9', 'd': '02', 'e': '日常训练及执勤', 'f': '/upload/legend/20200805/txm.png', 'g': '领导专用',
            'h': '杨梅', 'i': '2019-05-09至2019-05-12', 'j': '', 'k': [{ 'a': '机油更换' }, { 'a': '三滤更换' }],
            'l': [
              { 'h': '杨梅', 'i': '2019-01-12', 'j': '底部挡板磨损严重', 'k': [{ 'a': '机油更换' }, { 'a': '正时皮带更换' }] },
              { 'h': '杨梅', 'i': '2019-05-12', 'j': '--', 'k': [{ 'a': '机油更换' }] }]
          },
          { 'id': 'd', 'a': '工程车', 'b': '2015-11-11', 'c': '3', 'd': '01', 'e': '日常训练及执勤', 'f': '/upload/legend/20200805/txm.png', 'g': '防弹',
            'h': '杨梅', 'i': '2019-11-11至2019-11-12', 'j': '勤清洗', 'k': [{ 'a': '机油更换' }],
            'l': [
              { 'h': '杨梅', 'i': '2019-01-12', 'j': '--', 'k': [{ 'a': '机油更换' }] },
              { 'h': '杨梅', 'i': '2019-11-12', 'j': '刹车片下次更换', 'k': [{ 'a': '机油更换' }, { 'a': '轮胎更换' }] }]
          }
        ],
        'totalElements': 10
      }
    }
  },
  people() {
    return {
      'code': 200,
      'message': '操作成功！',
      'success': true,
      'data': [
        { 'id': 'a', 'a': '杨梅', 'b': '女', 'c': '01', 'd': '2015-01-06' },
        { 'id': 'b', 'a': '胡惟一', 'b': '男', 'c': '02', 'd': '2015-06-23' },
        { 'id': 'c', 'a': '李雪', 'b': '女', 'c': '03', 'd': '2019-05-15' },
        { 'id': 'd', 'a': '万强', 'b': '男', 'c': '02', 'd': '2015-11-11' },
        { 'id': 'e', 'a': '张立', 'b': '男', 'c': '04', 'd': '2019-12-06' }
      ]
    }
  },
  create(data) {
    return request({
      url: `/vue-element-admin/door/create`,
      method: 'post',
      data: data
    })
  },
  update(data) {
    return request({
      url: `/vue-element-admin/door/update`,
      method: 'put',
      data: data
    })
  },
  del(id) {
    return request({
      url: `/vue-element-admin/door/delete`,
      method: 'delete'
    })
  },
  detail(id) {
    return request({
      url: `/vue-element-admin/door/detail`,
      method: 'get'
    })
  },
  upload(id) {
    return request({
      url: `/vue-element-admin/door/detail`,
      method: 'get'
    })
  }
}
