import request from '@/utils/request'
export default {
  dict(data) {
    return {
      'code': 200,
      'message': '操作成功！',
      'success': true,
      'data': {
        '01': [
          { 'key': '01', 'value': '枪械维修专家' },
          { 'key': '02', 'value': '机械设备维修专家' },
          { 'key': '03', 'value': '车辆维修专家' }
        ],
        '02': [
          { 'key': '01', 'value': '枪械维修部' },
          { 'key': '02', 'value': '机械设备维修部' },
          { 'key': '03', 'value': '车辆维修部' },
          { 'key': '04', 'value': '枪械保养部' },
          { 'key': '05', 'value': '机械设备保养部' },
          { 'key': '06', 'value': '车辆保养部' }
        ],
        '03': [
          { 'key': '01', 'value': '技术宣讲' },
          { 'key': '02', 'value': '科技普及' },
          { 'key': '03', 'value': '制度宣讲' }
        ],
        '04': [
          { 'key': '01', 'value': '网上培训' },
          { 'key': '02', 'value': '现场集体培训' }
        ]
      }
    }
  },
  page(data) {
    return {
      'code': 200,
      'message': '操作成功！',
      'success': true,
      'data': {
        'content': [
          { 'id': 'a', 'a': 'xls0207001', 'b': '张猛', 'c': '/upload/legend/20200805/txm1.png', 'd': '身份证', 'e': '458265199102351485', 'f': '1982-06-03', 'g': '男', 'h': '181', 'i': '已婚', 'j': '良好',
            'k': '群众', 'l': '大学本科', 'm': '机械设计制造', 'n': '汉族', 'o': '长沙市长沙县星沙大道507', 'p': '机械设备维修专家', 'q': '机械设备维修部' },
          { 'id': 'b', 'a': 'qxs0918001', 'b': '胡志强', 'c': '/upload/legend/20200805/txm1.png', 'd': '身份证', 'e': '458265199102351486', 'f': '1984-06-07', 'g': '男', 'h': '160', 'i': '已婚', 'j': '良好',
            'k': '群众', 'l': '大学本科', 'm': '火炮与弹药制造', 'n': '汉族', 'o': '长沙市长沙县星沙大道508', 'p': '枪械维修专家', 'q': '枪械维修部' },
          { 'id': 'c', 'a': 'qxs0918002', 'b': '张斌', 'c': '/upload/legend/20200805/txm1.png', 'd': '身份证', 'e': '458265199102351487', 'f': '1981-08-01', 'g': '男', 'h': '163', 'i': '已婚', 'j': '良好',
            'k': '群众', 'l': '大学本科', 'm': '火炮与弹药制造', 'n': '汉族', 'o': '长沙市长沙县星沙大道509', 'p': '枪械维修专家', 'q': '枪械保养部' },
          { 'id': 'd', 'a': 'cl0506001', 'b': '王德', 'c': '/upload/legend/20200805/txm1.png', 'd': '身份证', 'e': '458265199102351488', 'f': '1982-11-03', 'g': '男', 'h': '187', 'i': '已婚', 'j': '良好',
            'k': '群众', 'l': '大学本科', 'm': '车辆制造工程', 'n': '汉族', 'o': '长沙市长沙县星沙大道511', 'p': '车辆维修专家', 'q': '车辆维修专家' },
          { 'id': 'e', 'a': 'cl0918001', 'b': '吴芝', 'c': '/upload/legend/20200805/txm1.png', 'd': '身份证', 'e': '458265199102351489', 'f': '1992-01-03', 'g': '男', 'h': '153', 'i': '未婚', 'j': '良好',
            'k': '群众', 'l': '大学本科', 'm': '车辆制造工程', 'n': '汉族', 'o': '长沙市长沙县星沙大道516', 'p': '车辆维修专家', 'q': '车辆保养部' }
        ],
        'totalElements': 10
      }
    }
  },
  page1(data) {
    return {
      'code': 200,
      'message': '操作成功！',
      'success': true,
      'data': {
        'content': [
          { 'id': 'a', 'a': 'xce-054新型工程车普及', 'b': '02', 'c': '2019-06-26', 'd': '小会议室', 'e': '02', 'f': '吴芝', 'g': '王德', 'h': '02', 'i': 'xce-054新型工程车构造图讲解',
            'j': [
              { 'id': 'a', 'a': 'xls0207001', 'b': '张猛', 'c': '/upload/legend/20200805/txm1.png', 'd': '身份证', 'e': '458265199102351485', 'f': '1982-06-03', 'g': '男', 'h': '181', 'i': '已婚', 'j': '良好',
                'k': '群众', 'l': '大学本科', 'm': '机械设计制造', 'n': '汉族', 'o': '长沙市长沙县星沙大道507', 'p': '机械设备维修专家', 'q': '机械设备维修部' },
              { 'id': 'b', 'a': 'qxs0918001', 'b': '胡志强', 'c': '/upload/legend/20200805/txm1.png', 'd': '身份证', 'e': '458265199102351486', 'f': '1984-06-07', 'g': '男', 'h': '160', 'i': '已婚', 'j': '良好',
                'k': '群众', 'l': '大学本科', 'm': '火炮与弹药制造', 'n': '汉族', 'o': '长沙市长沙县星沙大道508', 'p': '枪械维修专家', 'q': '枪械维修部' },
              { 'id': 'c', 'a': 'qxs0918002', 'b': '张斌', 'c': '/upload/legend/20200805/txm1.png', 'd': '身份证', 'e': '458265199102351487', 'f': '1981-08-01', 'g': '男', 'h': '163', 'i': '已婚', 'j': '良好',
                'k': '群众', 'l': '大学本科', 'm': '火炮与弹药制造', 'n': '汉族', 'o': '长沙市长沙县星沙大道509', 'p': '枪械维修专家', 'q': '枪械保养部' }
            ]
          },
          { 'id': 'b', 'a': 'P90手枪改造', 'b': '01', 'c': '2019-07-01', 'd': '交流中心', 'e': '02', 'f': '张斌', 'g': '王德', 'h': '02', 'i': '弹夹改造',
            'j': [
              { 'id': 'a', 'a': 'xls0207001', 'b': '张猛', 'c': '/upload/legend/20200805/txm1.png', 'd': '身份证', 'e': '458265199102351485', 'f': '1982-06-03', 'g': '男', 'h': '181', 'i': '已婚', 'j': '良好',
                'k': '群众', 'l': '大学本科', 'm': '机械设计制造', 'n': '汉族', 'o': '长沙市长沙县星沙大道507', 'p': '机械设备维修专家', 'q': '机械设备维修部' },
              { 'id': 'b', 'a': 'qxs0918001', 'b': '胡志强', 'c': '/upload/legend/20200805/txm1.png', 'd': '身份证', 'e': '458265199102351486', 'f': '1984-06-07', 'g': '男', 'h': '160', 'i': '已婚', 'j': '良好',
                'k': '群众', 'l': '大学本科', 'm': '火炮与弹药制造', 'n': '汉族', 'o': '长沙市长沙县星沙大道508', 'p': '枪械维修专家', 'q': '枪械维修部' },
              { 'id': 'c', 'a': 'qxs0918002', 'b': '张斌', 'c': '/upload/legend/20200805/txm1.png', 'd': '身份证', 'e': '458265199102351487', 'f': '1981-08-01', 'g': '男', 'h': '163', 'i': '已婚', 'j': '良好',
                'k': '群众', 'l': '大学本科', 'm': '火炮与弹药制造', 'n': '汉族', 'o': '长沙市长沙县星沙大道509', 'p': '枪械维修专家', 'q': '枪械保养部' }
            ]
          },
          { 'id': 'c', 'a': '95坦克构造普及', 'b': '02', 'c': '2019-08-15', 'd': '宣传室1', 'e': '02', 'f': '吴芝', 'g': '王德', 'h': '02', 'i': '95坦克构造普及',
            'j': [
              { 'id': 'c', 'a': 'qxs0918002', 'b': '张斌', 'c': '/upload/legend/20200805/txm1.png', 'd': '身份证', 'e': '458265199102351487', 'f': '1981-08-01', 'g': '男', 'h': '163', 'i': '已婚', 'j': '良好',
                'k': '群众', 'l': '大学本科', 'm': '火炮与弹药制造', 'n': '汉族', 'o': '长沙市长沙县星沙大道509', 'p': '枪械维修专家', 'q': '枪械保养部' },
              { 'id': 'd', 'a': 'cl0506001', 'b': '王德', 'c': '/upload/legend/20200805/txm1.png', 'd': '身份证', 'e': '458265199102351488', 'f': '1982-11-03', 'g': '男', 'h': '187', 'i': '已婚', 'j': '良好',
                'k': '群众', 'l': '大学本科', 'm': '车辆制造工程', 'n': '汉族', 'o': '长沙市长沙县星沙大道511', 'p': '车辆维修专家', 'q': '车辆维修专家' },
              { 'id': 'e', 'a': 'cl0918001', 'b': '吴芝', 'c': '/upload/legend/20200805/txm1.png', 'd': '身份证', 'e': '458265199102351489', 'f': '1992-01-03', 'g': '男', 'h': '153', 'i': '未婚', 'j': '良好',
                'k': '群众', 'l': '大学本科', 'm': '车辆制造工程', 'n': '汉族', 'o': '长沙市长沙县星沙大道516', 'p': '车辆维修专家', 'q': '车辆保养部' }
            ]
          },
          { 'id': 'd', 'a': '95坦克拆卸教学', 'b': '02', 'c': '2019-09-07', 'd': '交流中心', 'e': '02', 'f': '胡志强', 'g': '王德', 'h': '02', 'i': '95坦克拆卸教学',
            'j': [
              { 'id': 'a', 'a': 'xls0207001', 'b': '张猛', 'c': '/upload/legend/20200805/txm1.png', 'd': '身份证', 'e': '458265199102351485', 'f': '1982-06-03', 'g': '男', 'h': '181', 'i': '已婚', 'j': '良好',
                'k': '群众', 'l': '大学本科', 'm': '机械设计制造', 'n': '汉族', 'o': '长沙市长沙县星沙大道507', 'p': '机械设备维修专家', 'q': '机械设备维修部' },
              { 'id': 'b', 'a': 'qxs0918001', 'b': '胡志强', 'c': '/upload/legend/20200805/txm1.png', 'd': '身份证', 'e': '458265199102351486', 'f': '1984-06-07', 'g': '男', 'h': '160', 'i': '已婚', 'j': '良好',
                'k': '群众', 'l': '大学本科', 'm': '火炮与弹药制造', 'n': '汉族', 'o': '长沙市长沙县星沙大道508', 'p': '枪械维修专家', 'q': '枪械维修部' },
              { 'id': 'c', 'a': 'qxs0918002', 'b': '张斌', 'c': '/upload/legend/20200805/txm1.png', 'd': '身份证', 'e': '458265199102351487', 'f': '1981-08-01', 'g': '男', 'h': '163', 'i': '已婚', 'j': '良好',
                'k': '群众', 'l': '大学本科', 'm': '火炮与弹药制造', 'n': '汉族', 'o': '长沙市长沙县星沙大道509', 'p': '枪械维修专家', 'q': '枪械保养部' }
            ]
          }
        ],
        'totalElements': 10
      }
    }
  },
  create(data) {
    return request({
      url: `/vue-element-admin/door/create`,
      method: 'post',
      data: data
    })
  },
  update(data) {
    return request({
      url: `/vue-element-admin/door/update`,
      method: 'put',
      data: data
    })
  },
  del(id) {
    return request({
      url: `/vue-element-admin/door/delete`,
      method: 'delete'
    })
  },
  detail(id) {
    return request({
      url: `/vue-element-admin/door/detail`,
      method: 'get'
    })
  },
  upload(id) {
    return request({
      url: `/vue-element-admin/door/detail`,
      method: 'get'
    })
  }
}
